# **Agnieszka Kojs**

## **Zadanie 4**

Utwórz dataframe, w którym kolumny mają nazwy: name, surname, age, sex. Uzupełnij pięcioma dowolnymi rekordami oraz wyświetl informacje o danych pandas inf, opis danych pandas describe, wyświetl pierwsze trzy rekordy pandas head.

In [30]:
import pandas as pd
import numpy as np

In [31]:
# Zdefiniowanie danych oraz utworzenie DataFrame
d = [['Usian', 'Bolt', 35, 'man'], ['Eliud', 'Kipchoge', 36, 'man'], ['Ryan', 'Crouser', 28, 'man'], ['Yulimar', 'Rojas', 25, 'woman'], ['Kendra', 'Harrison', 29, 'woman']]
col = ['name', 'surname', 'age', 'sex']
dataframe = pd.DataFrame(data=d, columns=col)

In [32]:
# Wyświtlenie całej DataFrame
print(dataframe)

      name   surname  age    sex
0    Usian      Bolt   35    man
1    Eliud  Kipchoge   36    man
2     Ryan   Crouser   28    man
3  Yulimar     Rojas   25  woman
4   Kendra  Harrison   29  woman

In [33]:
# Wyświtlenie informacji o danych zawartych w DataFrame
print('\nWyświetlenie informacji o danych')
dataframe.info()

Wyświetlenie informacji o danych
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   surname  5 non-null      object
 2   age      5 non-null      int64
 3   sex      5 non-null      object
dtypes: int64(1), object(3)
memory usage: 164.0+ bytes

In [34]:
# Wyświtlenie statystyk opisowych
dataframe.describe(include='all')

         name   surname        age  sex
count       5         5   5.000000    5
unique      5         5        NaN    2
top     Eliud  Kipchoge        NaN  man
freq        1         1        NaN    3
mean      NaN       NaN  30.600000  NaN
std       NaN       NaN   4.722288  NaN
min       NaN       NaN  25.000000  NaN
25%       NaN       NaN  28.000000  NaN
50%       NaN       NaN  29.000000  NaN
75%       NaN       NaN  35.000000  NaN
max       NaN       NaN  36.000000  NaN

In [35]:
# Wyświetlenie pierwszych 3 rekordów
print('\nWyświetlenie pierwszych 3 rekordów:')
dataframe.head(3)

Wyświetlenie pierwszych 3 rekordów:

    name   surname  age  sex
0  Usian      Bolt   35  man
1  Eliud  Kipchoge   36  man
2   Ryan   Crouser   28  man